In [27]:
# two sum

k = 9
arr = [1,3,5,7,2]

def two_sum(a, target):
    seen = {}
    for i, v in enumerate(arr):
        diff = target - v
        if diff in seen:
            return [i, seen[diff]]
        seen[v] = i

print(two_sum(arr,k))

[4, 3]

In [28]:
# three sum
k = 9
a = [1,2,3,4,5]

#A+B+C = Target, B+C = Target - A

def three_sum(a, target):
    
    for i in range(len(a)):
        seen = {}
        current_target = target - i

        for j in range(i+1, len(a)):
            diff = current_target - j
            if diff in seen:
                return [i, seen[diff], j]
            seen[a[j]] = j
    


print(three_sum(a,k))

[1, 3, 4]

In [32]:
# longest string without repeating characters

s = "dscsdsdavfs"

def longest_substring(s):
    left = 0
    start = 0
    max_len = 0
    seen = {}

    for right, v in enumerate(s):
        if v in seen and left <= seen[v]:
            left = seen[v] + 1

        seen[v] = right

        if right - left + 1 > max_len:
            max_len = right - left + 1
            start = left
        
    return max_len, s[start: start + max_len]
print(longest_substring(s))

(5, 'sdavf')

In [10]:
# fibonacci sequence using memoization

#brute force
def fibonacci(n):
    a,b = 0,1
    result = [a,b]
    while n > 0:
        a,b = b,a+b
        result.append(b)
        n-=1

    return result

print(fibonacci(10))

# optimised
def fibonacci_memo(n, hsh={}):
    if n in hsh:
        return hsh[n]
    if n <=1:
        return n
    
    hsh[n] = fibonacci_memo(n-1, hsh) + fibonacci_memo(n-2, hsh)
    return hsh[n]

for i in range(10):
    print(fibonacci_memo(i), end=" ")

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
0 1 1 2 3 5 8 13 21 34

In [24]:
# factorial

def factorial(n):
    result = 1
    for i in range(1,n+1):
        result = result*i
    
    return result

print(factorial(5))

def factorial_memo(n,hsh={}):
    if n in hsh:
        return hsh[n]
    if n<=1:
        return n
    
    hsh[n] = n*factorial_memo(n-1, hsh)
    return hsh[n]

print(factorial_memo(13))

120
6227020800

In [18]:
import pandas as pd

df1 = pd.read_csv("./../data/employee.csv")
df2 = pd.read_csv("./../data/employee2.csv")

merged_df = pd.concat([df1, df2], ignore_index=True)

merged_df = merged_df.fillna({'address': "Unknown"})

merged_df

  Department Employee  Salary  address
0         HR     John  4000.0  Unknown
1         HR    Alice  3500.0  Unknown
2         IT      Bob  4500.0  Unknown
3         IT    Cathy  4800.0  Unknown
4        NaN     Toby  1000.0  Unknown
5      sales      max   100.0    delhi
6      sales    teddy   200.0  kolkata
7   accounts    bassa     NaN   mumbai

In [14]:
merged_df.iloc[:-1]

  Department Employee  Salary  address
0         HR     John  4000.0  Unknown
1         HR    Alice  3500.0  Unknown
2         IT      Bob  4500.0  Unknown
3         IT    Cathy  4800.0  Unknown
4        NaN     Toby  1000.0  Unknown
5      sales      max   100.0    delhi
6      sales    teddy   200.0  kolkata

In [26]:
subset_df = merged_df.iloc[0:4, 0:3]
subset_df

  Department Employee  Salary
0         HR     John  4000.0
1         HR    Alice  3500.0
2         IT      Bob  4500.0
3         IT    Cathy  4800.0

In [27]:
subset_df.sort(subset_df['Salary'])

AttributeError: 'DataFrame' object has no attribute 'sort'